NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf7120E_wificore</name>
  <series>nrf71</series>
  <version>1</version>
  <description>System-on-chip with a 32-bit Arm Cortex-M33 microcontroller</description>
  <licenseText>
Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <peripherals>
    <peripheral>
      <name>GLOBAL_WICR</name>
      <description>Wi-Fi Information Configuration Registers</description>
      <baseAddress>0x003FD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>WICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>FIRMWARE</name>
          <description>Unspecified</description>
          <headerStructName>WICR_FIRMWARE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>LMACINITPC</name>
            <description>Boot address for LMAC processor (defaults to start of Wi-Fi core ROM_0)</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x28080000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITPC</name>
                <description>LMAC boot vector</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UMACINITPC</name>
            <description>Boot address for UMAC processor (defaults to start of Wi-Fi core ROM_1)</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x28180000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITPC</name>
                <description>UMAC boot vector</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LMACROMPATCHADDR</name>
            <description>Address in MRAM for LMAC ROM patch</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>Address</name>
                <description>LMAC ROM patch address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UMACROMPATCHADDR</name>
            <description>Address in MRAM for UMAC ROM patch</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>Address</name>
                <description>UMAC ROM patch address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IPCCONFIG</name>
          <description>Unspecified</description>
          <headerStructName>WICR_IPCCONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x080</addressOffset>
          <register>
            <name>COMMANDMBOXADDR</name>
            <description>Base address of command mailbox</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Base address of mailbox</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COMMANDMBOXSIZE</name>
            <description>Size of command mailbox in bytes</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTMBOXADDR</name>
            <description>Base address of event mailbox</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Base address of mailbox</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENTMBOXSIZE</name>
            <description>Size of event mailbox in bytes</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SPAREMBOXADDR</name>
            <description>Base address of spare mailbox</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <dataType>uint32_t *</dataType>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Base address of mailbox</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SPAREMBOXSIZE</name>
            <description>Size of spare mailbox in bytes</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>VTFDATA</name>
          <description>Pointer to memory location containing VTF data from the VTF monitoring system</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of the VTF monitoring data in RAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
