NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore.svd
        <register>
          <name>GHWCFG3</name>
          <description>User Hardware Configuration 3 Register</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0B80C0E8</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZEWIDTH</name>
              <description>Width of Transfer Size Counters (XferSizeWidth)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDTH11</name>
                  <description>Width of Transfer Size Counter 11 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH12</name>
                  <description>Width of Transfer Size Counter 12 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH13</name>
                  <description>Width of Transfer Size Counter 13 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH14</name>
                  <description>Width of Transfer Size Counter 14 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH15</name>
                  <description>Width of Transfer Size Counter 15 bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH16</name>
                  <description>Width of Transfer Size Counter 16 bits</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH17</name>
                  <description>Width of Transfer Size Counter 17 bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH18</name>
                  <description>Width of Transfer Size Counter 18 bits</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH19</name>
                  <description>Width of Transfer Size Counter 19 bits</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTSIZEWIDTH</name>
              <description>Width of Packet Size Counters (PktSizeWidth)</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BITS4</name>
                  <description>Width of Packet Size Counter 4</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS5</name>
                  <description>Width of Packet Size Counter 5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS6</name>
                  <description>Width of Packet Size Counter 6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS7</name>
                  <description>Width of Packet Size Counter 7</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS8</name>
                  <description>Width of Packet Size Counter 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS9</name>
                  <description>Width of Packet Size Counter 9</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BITS10</name>
                  <description>Width of Packet Size Counter 10</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTGEN</name>
              <description>OTG Function Enabled (OtgEn)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not OTG Capable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>OTG Capable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CINTSEL</name>
              <description>I2C Selection (I2CIntSel)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>I2C Interface is not available</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>I2C Interface is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VNDCTLSUPT</name>
              <description>Vendor Control Interface Support (VndctlSupt)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Vendor Control Interface is not available.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Vendor Control Interface is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPTFEATURE</name>
              <description>Optional Features Removed (OptFeature)</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Optional features were not Removed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Optional Features have been Removed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTTYPE</name>
              <description>Reset Style for Clocked always Blocks in RTL (RstType)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNCRST</name>
                  <description>Asynchronous reset is used in the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCRST</name>
                  <description>Synchronous reset is used in the core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADPSUPPORT</name>
              <description>This bit indicates whether ADP logic is present within or external to the controller</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>ADP logic is not present along with the controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>ADP logic is present along with the controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSICMODE</name>
              <description>HSIC mode specified for Mode of Operation</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No HSIC capability</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HSIC-capable with shared UTMI PHY interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCSUPPORT</name>
              <description>This bit indicates the controller support for Battery Charger.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No Battery Charger Support</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Battery Charger Support present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMMODE</name>
              <description>LPM mode specified for Mode of Operation.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LPM disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LPM enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFIFODEPTH</name>
              <description>DFIFO Depth (DfifoDepth - EP_LOC_CNT)</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
