NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore.svd
        <register>
          <name>GPWRDN</name>
          <description>Global Power Down Register</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PMUINTSEL</name>
              <description>PMU Interrupt Select (PMUIntSel)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Internal DWC_otg_core interrupt is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>External DWC_otg_pmu interrupt is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUACTV</name>
              <description>PMU Active (PMUActv)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable PMU module</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable PMU module</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTORE</name>
              <description>Restore</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The controller in normal mode of operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The controller in Restore mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNCLMP</name>
              <description>Power Down Clamp (PwrDnClmp)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable PMU power clamp</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable PMU power clamp</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNRSTN</name>
              <description>Power Down ResetN (PwrDnRst_n)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Reset the controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The controller is in normal operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNSWTCH</name>
              <description>Power Down Switch (PwrDnSwtch)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>The controller is in ON state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>The controller is in OFF state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLEVBUS</name>
              <description>DisableVBUS</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Host mode:HPRT0.PrtPwr was not programmed to 0, and in Device mode:Session Valid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Host mode:HPRT0.PrtPwr was programmed to 0 and in Device mode:Session End</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNSTSCHNG</name>
              <description>Line State Change (LnStsChng)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No LineState change on USB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LineState change on USB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINESTAGECHANGEMSK</name>
              <description>LineStageChangeMsk</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for LineStateChange Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No LineStateChange Interrupt Mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETDETECTED</name>
              <description>ResetDetected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Reset not detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Reset detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETDETMSK</name>
              <description>ResetDetMsk</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for ResetDetect Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No ResetDetect Interrupt Mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONNECTDETECT</name>
              <description>DisconnectDetect</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disconnect not detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Disconnect detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONNECTDETECTMSK</name>
              <description>DisconnectDetectMsk</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for DisconnectDetect Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No DisconnectDetect Interrupt Mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNECTDET</name>
              <description>ConnectDet</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Connect not detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Connect detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNDETMSK</name>
              <description>ConnDetMsk</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No ConnectDet Interrupt Mask</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for ConnectDet Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRPDETECT</name>
              <description>SRPDetect</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>SRP not detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>SRP detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRPDETECTMSK</name>
              <description>SRPDetectMsk</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No SRPDetect Interrupt Mask</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for SRPDetect Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSCHNGINT</name>
              <description>Status Change Interrupt (StsChngInt)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No Status change</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Status change detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSCHNGINTMSK</name>
              <description>StsChngIntMsk</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask for Status Change Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Status Change Interrupt Mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINESTATE</name>
              <description>LineState</description>
              <lsb>19</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS1</name>
                  <description>Linestate on USB: DM = 0, DP = 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS2</name>
                  <description>Linestate on USB: DM = 0, DP = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS3</name>
                  <description>Linestate on USB: DM = 1, DP = 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS4</name>
                  <description>Linestate on USB: Not-defined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDDIG</name>
              <description>This bit indicates the status of the signal IDDIG. The application must read this bit after receiving GPWRDN.StsChngInt and decode based on the previous value stored by the application.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Host Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Device Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSESSVLD</name>
              <description>B Session Valid (BSessVld)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>B_Valid is 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>B_Valid is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTVALIDBC</name>
              <description>MultValIdBC</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RID_0</name>
                  <description>OTG device as B-device</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_C</name>
                  <description>OTG device as B-device, can connect</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_B</name>
                  <description>OTG device as B-device, cannot connect</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_A</name>
                  <description>OTG device as A-device</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_GND</name>
                  <description>ID_OTG pin is grounded</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_A_RID_GND</name>
                  <description>OTG device as A-device, RID_A=1 and RID_GND=1</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_FLOAT</name>
                  <description>ID pull down when ID_OTG is floating</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_C_RID_FLOAT</name>
                  <description>OTG device as B-device, can connect, RID_C=1 and RID_FLOAT=1</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_B_RID_FLOAT</name>
                  <description>OTG device as B-device, cannot connect, RID_B=1 and RID_FLOAT=1</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_1</name>
                  <description>OTG device as A-device</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GDFIFOCFG</name>
          <description>Global DFIFO Configuration Register</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0B800C00</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GDFIFOCFG</name>
              <description>GDFIFOCfg</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EPINFOBASEADDR</name>
              <description>This field provides the start address of the EP info controller.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTMSK2</name>
          <description>Interrupt Mask Register 2</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GINTMSK2</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTSTS2</name>
          <description>Interrupt Register 2</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GINTSTS2</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXFSIZ</name>
          <description>Host Periodic Transmit FIFO Size Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C001800</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTXFSTADDR</name>
              <description>Host Periodic TxFIFO Start Address (PTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PTXFSIZE</name>
              <description>Host Periodic TxFIFO Depth (PTxFSize)</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0xF</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DIEPTXF[%s]</name>
          <description>Description collection: Device IN Endpoint Transmit FIFO 1 Size Register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C001800</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
