NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore.svd
        <register>
          <name>PCGCCTL</name>
          <description>Power and Clock Gating Control Register</description>
          <addressOffset>0xE00</addressOffset>
          <access>read-write</access>
          <resetValue>0x880A0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STOPPCLK</name>
              <description>Stop Pclk (StopPclk)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable Stop Pclk</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable Stop Pclk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATEHCLK</name>
              <description>Gate Hclk (GateHclk)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Clears this bit when the USB is resumed or a new session starts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Sets this bit to gate hclk to modules when the USB is suspended or the session is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTPDWNMODULE</name>
              <description>Reset Power-Down Modules (RstPdwnModule)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power is turned on</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Power is turned off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBLL1GATING</name>
              <description>Enable Sleep Clock Gating</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The PHY clock is not gated in Sleep state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The Core internal clock gating is enabled in Sleep state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYSLEEP</name>
              <description>PHY In Sleep</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Phy not in Sleep state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Phy in Sleep state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1SUSPENDED</name>
              <description>L1 Deep Sleep</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Non Deep Sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Deep Sleep</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREMODE</name>
              <description>Restore Mode (RestoreMode)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>In Host mode,this bit indicates Host-initiated Resume and Reset. In Device mode, this bit indicates Device-initiated Remote Wakeup</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>In Host mode,this bit indicates Device-initiated Remote Wakeup. In Device mode, this bit indicates Host-initiated Resume and Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESSREGRESTORED</name>
              <description>Essential Register Values Restored (EssRegRestored)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RESTORED</name>
                  <description>Register values of essential registers are not restored</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTORED</name>
                  <description>Register values of essential registers have been restored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTOREVALUE</name>
              <description>Restore Value (RestoreValue)</description>
              <lsb>14</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
