NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00">
      <name>GLOBAL_UARTE20</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x500C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM20</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM20_SPIS20_TWIM20_TWIS20_UARTE20</name>
        <value>198</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00">
      <name>GLOBAL_SPIM21</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM21_SPIS21_TWIM21_TWIS21_UARTE21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00">
      <name>GLOBAL_SPIS21</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM21_SPIS21_TWIM21_TWIS21_UARTE21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20">
      <name>GLOBAL_TWIM21</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM21_SPIS21_TWIM21_TWIS21_UARTE21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20">
      <name>GLOBAL_TWIS21</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM21_SPIS21_TWIM21_TWIS21_UARTE21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00">
      <name>GLOBAL_UARTE21</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x500C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM21_SPIS21_TWIM21_TWIS21_UARTE21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00">
      <name>GLOBAL_SPIM22</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x500C8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM22_SPIS22_TWIM22_TWIS22_UARTE22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00">
      <name>GLOBAL_SPIS22</name>
      <description>SPI Slave 4</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM22_SPIS22_TWIM22_TWIS22_UARTE22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20">
      <name>GLOBAL_TWIM22</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM22_SPIS22_TWIM22_TWIS22_UARTE22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20">
      <name>GLOBAL_TWIS22</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM22_SPIS22_TWIM22_TWIS22_UARTE22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00">
      <name>GLOBAL_UARTE22</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x500C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM22_SPIS22_TWIM22_TWIS22_UARTE22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU00">
      <name>GLOBAL_EGU20</name>
      <description>Event generator unit 2</description>
      <baseAddress>0x500C9000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00">
      <name>GLOBAL_TIMER20</name>
      <description>Timer/Counter 2</description>
      <baseAddress>0x500CA000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER20</name>
        <value>202</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00">
      <name>GLOBAL_TIMER21</name>
      <description>Timer/Counter 3</description>
      <baseAddress>0x500CB000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER21</name>
        <value>203</value>
      </interrupt>
    </peripheral>
